** shell 
#+begin_src emacs-lisp
  (defun my/async-shell-command (command buffer-name)
    "execute command async and display the output and error message in a buffer named buffer-name"
    (let* ((output-buffer (get-or-create-named-buffer buffer-name)))
      (async-shell-command command output-buffer output-buffer)
      ))  

  ;; (my/async-shell-command "ls" "*ls-buffer*")
#+end_src

#+RESULTS:
: #<window 94 on *ls-buffer*>

** python

#+begin_src emacs-lisp
  (setq org-babel-python-command "/Users/hanxiao/code/mz-ds-deep-learning/cpi-model/.venv/bin/python")

#+end_src

#+RESULTS:
: /Users/hanxiao/code/mz-ds-deep-learning/cpi-model/.venv/bin/python

** global variables

#+begin_src emacs-lisp
  (defvar unity/model-types (list "bhv" "advctx") "the list of model types by traffic")
  ;; (setq unity/model-types (list "bhv" "advctx"))
#+end_src

#+RESULTS:
| bhv | advctx |

